---
kind: method
id: M:Autodesk.Revit.DB.NumericRevisionSettings.#ctor
source: html/a1f88408-da3c-2d16-7cdb-3bd75b1017e4.htm
---
# Autodesk.Revit.DB.NumericRevisionSettings.#ctor Method

Constructs a NumericRevisionSettings with a simple, default numbering sequence.

## Syntax (C#)
```csharp
public NumericRevisionSettings()
```

## Remarks
Initializes startNumber to 1.
 The prefix and suffix strings are set to empty.